# Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление. 
# Функцию hex используйте для проверки своего результата

number = 1937
hex_string = hex(number)

print(hex_string)